/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   put_grid.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rkasuya <rkasuya@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/02/14 03:42:56 by rkasuya           #+#    #+#             */
/*   Updated: 2026/02/14 20:39:25 by rkasuya          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	put_grid(int answer[4][4])　//4*4の解答グリッドを出力する関数
{
	int		i;　//行(縦)のインデックス
	int		j;　//列(横)のインデックス
	char	c;　//表示する文字

	//初期化
	i = 0; 
	j = 0; 
	
	while (i < 4)　//4行繰り返す
	{
		while (j < 4)  // 各行で4列繰り返す
		{
			c = answer[i][j] + '0';  // 数字を文字に変換
			
			write(1, &c, 1);　// 1文字表示
			if (j != 3)
				write(1, " ", 1);　// 最後の列以外はスペースを追加
			j++;
		}
		i++;
		j = 0;   // 列インデックスをリセット
		write(1, "\n", 1); // 1行ごとに改行
	}
}
