/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ultimate_ft.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yshigeto <yshigeto@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/02/08 22:23:09 by yshigeto          #+#    #+#             */
/*   Updated: 2026/02/09 22:18:26 by yshigeto         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_ultimate_ft(int *********nbr)
{
	*********nbr = 42;
}

int main()
{
	int i,j;
	int n0;
	int *n1 = &n0;
	int **n2 = &n1;
	int ***n3 = &n2;
	int ****n4 = &n3;
	int *****n5 = &n4;
	int ******n6 = &n5;
	int *******n7 = &n6;
	int ********n8 = &n7;
	int *********n9 = &n8;
  
	ft_ultimate_ft(n9);
	i = (n0 /10)+'0';
	j = (n0 %10)+'0';
	write(1, &i, 1);
	write(1, &j, 1);
	return 0;
}
//pointは人づてに「（この場合）42に変えて」と言っているので、それぞれの桁ごとに出そうと思うと、n0を10で割る必要がある
